In [23]:
In [1]: import pandas as pd
import matplotlib.pyplot as plt

In [9]:
pwd

'C:\\Users\\LENOVO\\_PYTHON_PROJECTS'

In [12]:
titanic = pd.read_csv("C:\\Users\\LENOVO\\_PYTHON_PROJECTS\\Titanic-Dataset.csv")

In [22]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [16]:
#maximum and minimum age that boarded titanic
max_age = titanic["Age"].max()
min_age = titanic["Age"].min()
print('maximum age is: ', max_age)
print('minimum age is: ', min_age)

maximum age is:  80.0
minimum age is:  0.42

In [17]:
titanic["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [18]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
childrenandyouth_names = titanic.loc[titanic['Age'] < 30, 'Name']
childrenandyouth_names

0                                Braund, Mr. Owen Harris
2                                 Heikkinen, Miss. Laina
7                         Palsson, Master. Gosta Leonard
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
                             ...
883                        Banfield, Mr. Frederick James
884                               Sutehall, Mr. Henry Jr
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
889                                Behr, Mr. Karl Howell
Name: Name, Length: 384, dtype: object

In [119]:
grouped = titanic.groupby("Sex")
male = grouped.get_group('male')
female = grouped.get_group('female')

In [69]:
#female_survival = female.groupby("Survived")
#female_dead = female_survival.get_group(0)['Survived'].count()
#female_alive = female_survival.get_group(1)['Survived'].count()

In [66]:
#male_survival = male.groupby("Survived")
#male_dead = male_survival.get_group(0)['Survived'].count()
#male_alive = male_survival.get_group(1)['Survived'].count()

In [90]:
#grouping the data by sex to obtain number of each sex that boarded titanic
group_by_sex = titanic.groupby("Sex")[['Survived']].agg(lambda x: x.astype(str).count())
group_by_sex

        Survived
Sex
female       314
male         577

In [142]:
#grouping the data by survived to obtain the number of those who died and those who were alive
group_by_survived = titanic.groupby('Survived')[['PassengerId']].agg(lambda x: x.astype(str).count())
group_by_survived

          PassengerId
Survived
0                 549
1                 342

In [138]:
#regrouping the data by sex to obtain number of males who died and those who were alive
group_by_male_survival = male.groupby('Survived')[['PassengerId']].agg(lambda x: x.astype(str).count())
group_by_male_survival

          PassengerId
Survived
0                 468
1                 109

In [126]:
#regrouping the data by sex to obtain number of females who died and those who were alive
group_by_female_survival = female.groupby('Survived')[['PassengerId']].agg(lambda x: x.astype(str).count())
group_by_female_survival

          PassengerId
Survived
0                  81
1                 233